Repository: tyukalov/eltools
Catalog: lang/src/eltools.po
Languages: ru

source: where power - engine power (default voltage=0.38, cos=0.9 ece=0.95, mode=ac3)
ru: где power - мощность двигателя в кВт (по умолчанию напряжение 0.38 кВ, косинус - 0.9, КПД - 0.95, mode - ac3)

source: Error reading the file
ru: Ошибка чтения файла!

source: Error! Illegal use of options
ru: Ошибка! Неправильное использование опции!

source: Error! Missing value from option!
ru: Ошибка! Требуется указать значение для опции

source: Error! Zero impedance
ru: Ошибка! Расчётное сопротивление равно нулю!

source: Incorrect combinations of modes
ru: Неправильная комбинация режимов

source: Incorrect data!
ru: Некорректные данные!

source: Incorrect voltage value - '%s'
ru: Некорректное значение напряжения - '%s'

source: Invalid argument!
ru: Некорректная опция

source: Invalid request
ru: Некорректный запрос

source: Invalid value for -i
ru: Неправильное значение для -i

source: Invalid value for -r
ru: Неправильное значение для -r

source: Invalid value for -u
ru: Неправильное значение для -u

source: Invalid value for -x
ru: Неправильное значение для -x

source: License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>. Written by Igor 'sp_r00t' Tyukalov.
ru: Лицензия GPLv3+: CNU GPL версии 3 или последующей <http://gnu.org/licenses/gpl.html>. Автор программы - Игорь 'sp_r00t' Тюкалов.

source: Point '%s' not found
ru: Расчётная точка '%s' не найдена

source: Too few arguments
ru: Слишком мало аргументов

source: Unknown error
ru: Неизвестная ошибка

source: Unknown mode - '%s'
ru: Неизвестная режим - %s

source: Unknown option '%s'
ru: Неизвестная опция %s

source: Usage %s %s
ru: Используйте: %s %s

source: Usage: %s [options] filename points... Where:
ru: Используйте: %s [options] filename points... Где:

source: Wrong number of arguments
ru: Неправильное число аргументов

source: m - mode. Takes on values: 1 - single-phase mode; 2 - two-phase mode; 3 - three-phase mode. u - voltage, V; filename - network file; points - points of calculation of short-circuit currents.
ru: m - режим КЗ. Принимает следующие значения : 1 - однофазный режим; 2 - двухфазный режим; 3 - трёхфазный режим. u - напряжение, В; filename - файл с описанием сети (смю Документацию); points - точки для расчёта токов КЗ.

source: where: -h or --help - print help -v or --version - print version -p - mode. With the option - single-phase, in the absence of - three-phase -d - type of current. With the option - DC, in the absence of - AC -i - amperage, -u - voltage, -r - resistance, -x - reactance,
ru: где: -h or --help - показать справку -v or --version - показать версию -p - режим. Однофазный в случае наличии опции и трёхфазный в случае отсутствия -d - род тока. Постоянный в случае наличия опции и переменный в случае отсутствия -i - сила тока, -u - напряжение, -r - активное сопротивление, -x - реактивное сопротивление,

source: where: mode - mode. 'dc' for D.C., 'ac' for single-phase alternating current, 'ac3' for three-phase alternating current; voltage - motor voltage; power - engine power; cos - power factor; ece - energy conversion efficiency, or:
ru: где: mode - режим. 'dc' для постоянного тока, 'ac' для переменного однофазного, 'ac3' для трехфазного; voltage - напряжение двигателя, кВ; power - мощность двигателя, кВт; cos - коэффициент мощности; ece - КПД; или:
